/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   sort_int_tab.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lmarie <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/15 16:29:53 by lmarie            #+#    #+#             */
/*   Updated: 2020/02/15 16:29:56 by lmarie           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

void sort_int_tab(int *tab, unsigned int size)
{
	unsigned int i;
	unsigned int j
	int tmp;

	i = 0;
	j = 0;
	tmp = 0;
	while(i < size)
	{
		while (j < size - i - 1)
		{
			if (tab[j] > tab[j +1])
			{
				tmp = tab[j]; // запоминаю предыдущее значение
				tab[j] = tab[j + 1]; // записываем в индекс значение большего
				tab[j + 1] = tmp; // 
			}
			j++
		}
		i++
	}
}
