/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_itoa.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: lmarie <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/02/15 17:37:30 by lmarie            #+#    #+#             */
/*   Updated: 2020/02/15 17:37:33 by lmarie           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>
#include <stdlib.h>

int		counter(int nbr)
{
	int i = 0;
	if (nbr < 0) // если отрицательное число, то добавляем еще знак
		i++;
	while (nbr != 0)
	{
		nbr = nbr / 10;
		i++;
	}
	return (i);
}


char	*ft_itoa(int nbr)
{
	char *p;
	int i;

	i = counter(nbr); // считаем сколько у нас разрядов
	p = (char*)malloc(sizeof(char) * (i));
	if (nbr < 0) // если nbr  отрицательный то мы записываем - в p[0]\
		и меняем знак на +
	{
		p[0] = '-';
		nbr = -nbr;
	}
	p[i] = '\0'; // в последний элемент записываем
	while (nbr != 0)
	{
		i--; // обратный отсчет
		p[i] = nbr % 10 + '0'; // записываем остаток в р
		nbr = nbr / 10; // уменьшаем на разряд
	}
	////////
//	i = 0;
//	while (p[i] != '\0')
//	{
//		printf("%c", p[i]);
//		i++;
//	}
	return (p);
}

int		main()
{
	ft_itoa(123443);
	return(0);
}
